CSI API ETABS v1
cDetailing.GetDetailedBeamLineData_2 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedBeamLineData_2(
	string TowerName,
	string StoryName,
	string BeamLineID,
	ref int NumberOfObjects,
	ref string[] ObjectUniqueNames,
	ref int NumberSpans,
	ref double[] SpanLength,
	ref int[] NumLongBars,
	ref string[] LongBarGUID,
	ref double[] LongBarDiameter,
	ref string[] LongBarNotation,
	ref double[] LongBarStartDist,
	ref int[] LongBarStartBend,
	ref int[] LongBarEndBend,
	ref double[] LongBarLength,
	ref int[] LongBarNumLayers,
	ref int[] NumTieBars,
	ref int[] NumTieVertLegs,
	ref string[] TieBarGUID,
	ref double[] TieBarDiameter,
	ref string[] TieBarNotation,
	ref double[] TieBarStartDist,
	ref double[] TieBarSpacing,
	ref int[] TieBarType
)
Function GetDetailedBeamLineData_2 (
	TowerName As String,
	StoryName As String,
	BeamLineID As String,
	ByRef NumberOfObjects As Integer,
	ByRef ObjectUniqueNames As String(),
	ByRef NumberSpans As Integer,
	ByRef SpanLength As Double(),
	ByRef NumLongBars As Integer(),
	ByRef LongBarGUID As String(),
	ByRef LongBarDiameter As Double(),
	ByRef LongBarNotation As String(),
	ByRef LongBarStartDist As Double(),
	ByRef LongBarStartBend As Integer(),
	ByRef LongBarEndBend As Integer(),
	ByRef LongBarLength As Double(),
	ByRef LongBarNumLayers As Integer(),
	ByRef NumTieBars As Integer(),
	ByRef NumTieVertLegs As Integer(),
	ByRef TieBarGUID As String(),
	ByRef TieBarDiameter As Double(),
	ByRef TieBarNotation As String(),
	ByRef TieBarStartDist As Double(),
	ByRef TieBarSpacing As Double(),
	ByRef TieBarType As Integer()
) As Integer
Dim instance As cDetailing
Dim TowerName As String
Dim StoryName As String
Dim BeamLineID As String
Dim NumberOfObjects As Integer
Dim ObjectUniqueNames As String()
Dim NumberSpans As Integer
Dim SpanLength As Double()
Dim NumLongBars As Integer()
Dim LongBarGUID As String()
Dim LongBarDiameter As Double()
Dim LongBarNotation As String()
Dim LongBarStartDist As Double()
Dim LongBarStartBend As Integer()
Dim LongBarEndBend As Integer()
Dim LongBarLength As Double()
Dim LongBarNumLayers As Integer()
Dim NumTieBars As Integer()
Dim NumTieVertLegs As Integer()
Dim TieBarGUID As String()
Dim TieBarDiameter As Double()
Dim TieBarNotation As String()
Dim TieBarStartDist As Double()
Dim TieBarSpacing As Double()
Dim TieBarType As Integer()
Dim returnValue As Integer
returnValue = instance.GetDetailedBeamLineData_2(TowerName,
	StoryName, BeamLineID, NumberOfObjects,
	ObjectUniqueNames, NumberSpans,
	SpanLength, NumLongBars, LongBarGUID,
	LongBarDiameter, LongBarNotation,
	LongBarStartDist, LongBarStartBend,
	LongBarEndBend, LongBarLength, LongBarNumLayers,
	NumTieBars, NumTieVertLegs, TieBarGUID,
	TieBarDiameter, TieBarNotation,
	TieBarStartDist, TieBarSpacing,
	TieBarType)
int GetDetailedBeamLineData_2(
	String^ TowerName,
	String^ StoryName,
	String^ BeamLineID,
	int% NumberOfObjects,
	array<String^>^% ObjectUniqueNames,
	int% NumberSpans,
	array<double>^% SpanLength,
	array<int>^% NumLongBars,
	array<String^>^% LongBarGUID,
	array<double>^% LongBarDiameter,
	array<String^>^% LongBarNotation,
	array<double>^% LongBarStartDist,
	array<int>^% LongBarStartBend,
	array<int>^% LongBarEndBend,
	array<double>^% LongBarLength,
	array<int>^% LongBarNumLayers,
	array<int>^% NumTieBars,
	array<int>^% NumTieVertLegs,
	array<String^>^% TieBarGUID,
	array<double>^% TieBarDiameter,
	array<String^>^% TieBarNotation,
	array<double>^% TieBarStartDist,
	array<double>^% TieBarSpacing,
	array<int>^% TieBarType
)
abstract GetDetailedBeamLineData_2 :
        TowerName : string *
        StoryName : string *
        BeamLineID : string *
        NumberOfObjects : int byref *
        ObjectUniqueNames : string[] byref *
        NumberSpans : int byref *
        SpanLength : float[] byref *
        NumLongBars : int[] byref *
        LongBarGUID : string[] byref *
        LongBarDiameter : float[] byref *
        LongBarNotation : string[] byref *
        LongBarStartDist : float[] byref *
        LongBarStartBend : int[] byref *
        LongBarEndBend : int[] byref *
        LongBarLength : float[] byref *
        LongBarNumLayers : int[] byref *
        NumTieBars : int[] byref *
        NumTieVertLegs : int[] byref *
        TieBarGUID : string[] byref *
        TieBarDiameter : float[] byref *
        TieBarNotation : string[] byref *
        TieBarStartDist : float[] byref *
        TieBarSpacing : float[] byref *
        TieBarType : int[] byref -> int
Parameters
TowerName
Type: System.String
StoryName
Type: System.String
BeamLineID
Type: System.String
NumberOfObjects
Type: System.Int32
ObjectUniqueNames
Type: System.String[]
NumberSpans
Type: System.Int32
SpanLength
Type: System.Double[]
NumLongBars
Type: System.Int32[]
LongBarGUID
Type: System.String[]
LongBarDiameter
Type: System.Double[]
LongBarNotation
Type: System.String[]
LongBarStartDist
Type: System.Double[]
LongBarStartBend
Type: System.Int32[]
LongBarEndBend
Type: System.Int32[]
LongBarLength
Type: System.Double[]
LongBarNumLayers
Type: System.Int32[]
NumTieBars
Type: System.Int32[]
NumTieVertLegs
Type: System.Int32[]
TieBarGUID
Type: System.String[]
TieBarDiameter
Type: System.Double[]
TieBarNotation
Type: System.String[]
TieBarStartDist
Type: System.Double[]
TieBarSpacing
Type: System.Double[]
TieBarType
Type: System.Int32[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace